Revit 2024 API
PlasticvinylBumpType Enumeration
 The enumerated type representing the permitted values for the asset property "PlasticvinylBump" from the "PlasticVinyl" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public enum PlasticvinylBumpType
Visual Basic
Public Enumeration PlasticvinylBumpType
Visual C++
public enum class PlasticvinylBumpType
Members
Member name | Description
None
Custom
See Also
Autodesk.Revit.DB.Visual Namespace